tap "emqx/mqttx"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "asdf"
brew "libssh2"
brew "bat"
brew "ccat"
brew "curl"
brew "deno"
brew "direnv"
brew "docker-credential-helper"
brew "eza"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-secrets"
brew "icu4c@75"
brew "graphviz"
brew "iproute2mac"
brew "jq"
brew "k6"
brew "mosquitto"
brew "nmap"
brew "nodebrew"
brew "pgcli"
brew "pre-commit"
brew "pure"
brew "starship"
brew "tfenv"
brew "tflint"
brew "tig"
brew "tree"
brew "trivy"
brew "typescript"
brew "vim"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "emqx/mqttx/mqttx-cli"
brew "hashicorp/tap/terraform"
brew "teamookla/speedtest/speedtest"
cask "discord"
cask "flameshot"
cask "google-cloud-sdk"
cask "rancher"
cask "stats"
cask "warp"
vscode "adpyke.codesnap"
vscode "alexcvzz.vscode-sqlite"
vscode "azemoh.one-monokai"
vscode "bmewburn.vscode-intelephense-client"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dmnsgn.vscode-wavefront"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jeff-hykin.polacode-2019"
vscode "kevinrose.vsc-python-indent"
vscode "leizongmin.node-module-intellisense"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "patricklee.vsnotes"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "pnp.polacode"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "saikou9901.evilinspector"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "starkwang.markdown"
vscode "tamasfe.even-better-toml"
vscode "thesofakillers.vscode-pbtxt"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
vscode "zxh404.vscode-proto3"
